lkolbly/cmsis-svd/data/TexasInstruments/LM3S6100.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="TIMER0">
      <name>TIMER1</name>
      <prependToName>TIMER1</prependToName>
      <baseAddress>0x40031000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIMER0">
      <name>TIMER2</name>
      <prependToName>TIMER2</prependToName>
      <baseAddress>0x40032000</baseAddress>
    </peripheral>
    <peripheral>
      <name>COMP</name>
      <description>Register map for COMP peripheral</description>
      <groupName>COMP</groupName>
      <prependToName>COMP</prependToName>
      <baseAddress>0x4003C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ACMIS</name>
          <description>Analog Comparator Masked Interrupt Status</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>COMP_ACMIS_IN0</name>
              <description>Comparator 0 Masked Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACRIS</name>
          <description>Analog Comparator Raw Interrupt Status</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>COMP_ACRIS_IN0</name>
              <description>Comparator 0 Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACINTEN</name>
          <description>Analog Comparator Interrupt Enable</description>
          <addressOffset>0x00000008</addressOffset>
          <fields>
            <field>
              <name>COMP_ACINTEN_IN0</name>
              <description>Comparator 0 Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACREFCTL</name>
          <description>Analog Comparator Reference Voltage Control</description>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>COMP_ACREFCTL_VREF</name>
              <description>Resistor Ladder Voltage Ref</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>COMP_ACREFCTL_RNG</name>
              <description>Resistor Ladder Range</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>COMP_ACREFCTL_EN</name>
              <description>Resistor Ladder Enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACSTAT0</name>
          <description>Analog Comparator Status 0</description>
          <addressOffset>0x00000020</addressOffset>
          <fields>
            <field>
              <name>COMP_ACSTAT0_OVAL</name>
              <description>Comparator Output Value</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACCTL0</name>
          <description>Analog Comparator Control 0</description>
          <addressOffset>0x00000024</addressOffset>
          <fields>
            <field>
              <name>COMP_ACCTL0_CINV</name>
              <description>Comparator Output Invert</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>COMP_ACCTL0_ISEN</name>
              <description>Interrupt Sense</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMP_ACCTL0_ISEN_LEVEL</name>
                  <description>Level sense, see ISLVAL</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL0_ISEN_FALL</name>
                  <description>Falling edge</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL0_ISEN_RISE</name>
                  <description>Rising edge</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL0_ISEN_BOTH</name>
                  <description>Either edge</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP_ACCTL0_ISLVAL</name>
              <description>Interrupt Sense Level Value</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>COMP_ACCTL0_ASRCP</name>
              <description>Analog Source Positive</description>
              <bitRange>[10:9]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMP_ACCTL0_ASRCP_PIN</name>
                  <description>Pin value of Cn+</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL0_ASRCP_PIN0</name>
                  <description>Pin value of C0+</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL0_ASRCP_REF</name>
                  <description>Internal voltage reference (VIREF)</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>MAC</name>
      <description>Register map for MAC peripheral</description>
      <groupName>MAC</groupName>
      <prependToName>MAC</prependToName>
      <baseAddress>0x40048000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>RIS</name>
          <description>Ethernet MAC Raw Interrupt Status/Acknowledge</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>MAC_RIS_RXINT</name>
              <description>Packet Received</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>MAC_RIS_TXER</name>
              <description>Transmit Error</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>MAC_RIS_TXEMP</name>
              <description>Transmit FIFO Empty</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>MAC_RIS_FOV</name>
              <description>FIFO Overrun</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>MAC_RIS_RXER</name>
              <description>Receive Error</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>MAC_RIS_MDINT</name>
              <description>MII Transaction Complete</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>MAC_RIS_PHYINT</name>
              <description>PHY Interrupt</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IACK</name>
          <description>Ethernet MAC Raw Interrupt Status/Acknowledge</description>
          <alternateGroup>MAC_ALT</alternateGroup>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>MAC_IACK_RXINT</name>
              <description>Clear Packet Received</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>MAC_IACK_TXER</name>
              <description>Clear Transmit Error</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>MAC_IACK_TXEMP</name>
              <description>Clear Transmit FIFO Empty</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>MAC_IACK_FOV</name>
              <description>Clear FIFO Overrun</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>MAC_IACK_RXER</name>
              <description>Clear Receive Error</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>MAC_IACK_MDINT</name>
              <description>Clear MII Transaction Complete</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>MAC_IACK_PHYINT</name>
              <description>Clear PHY Interrupt</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IM</name>
          <description>Ethernet MAC Interrupt Mask</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>MAC_IM_RXINTM</name>
              <description>Mask Packet Received</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>MAC_IM_TXERM</name>
              <description>Mask Transmit Error</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>MAC_IM_TXEMPM</name>
              <description>Mask Transmit FIFO Empty</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>MAC_IM_FOVM</name>
              <description>Mask FIFO Overrun</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>MAC_IM_RXERM</name>
              <description>Mask Receive Error</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>MAC_IM_MDINTM</name>
              <description>Mask MII Transaction Complete</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>MAC_IM_PHYINTM</name>
              <description>Mask PHY Interrupt</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCTL</name>
          <description>Ethernet MAC Receive Control</description>
          <addressOffset>0x00000008</addressOffset>
          <fields>
            <field>
              <name>MAC_RCTL_RXEN</name>
              <description>Enable Receiver</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>MAC_RCTL_AMUL</name>
              <description>Enable Multicast Frames</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>MAC_RCTL_PRMS</name>
              <description>Enable Promiscuous Mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>MAC_RCTL_BADCRC</name>
              <description>Enable Reject Bad CRC</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>MAC_RCTL_RSTFIFO</name>
              <description>Clear Receive FIFO</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TCTL</name>
          <description>Ethernet MAC Transmit Control</description>
          <addressOffset>0x0000000C</addressOffset>
          <fields>
            <field>
              <name>MAC_TCTL_TXEN</name>
              <description>Enable Transmitter</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>MAC_TCTL_PADEN</name>
              <description>Enable Packet Padding</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>MAC_TCTL_CRC</name>
              <description>Enable CRC Generation</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>MAC_TCTL_DUPLEX</name>
              <description>Enable Duplex Mode</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA</name>
          <description>Ethernet MAC Data</description>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>MAC_DATA_RXDATA</name>
              <description>Receive FIFO Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA</name>
          <description>Ethernet MAC Data</description>
          <alternateGroup>MAC_ALT</alternateGroup>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>MAC_DATA_TXDATA</name>
              <description>Transmit FIFO Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IA0</name>
          <description>Ethernet MAC Individual Address 0</description>
          <addressOffset>0x00000014</addressOffset>
          <fields>
            <field>
              <name>MAC_IA0_MACOCT1</name>
              <description>MAC Address Octet 1</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>MAC_IA0_MACOCT2</name>
              <description>MAC Address Octet 2</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>MAC_IA0_MACOCT3</name>
              <description>MAC Address Octet 3</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>MAC_IA0_MACOCT4</name>
              <description>MAC Address Octet 4</description>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IA1</name>
          <description>Ethernet MAC Individual Address 1</description>
          <addressOffset>0x00000018</addressOffset>
          <fields>
            <field>
              <name>MAC_IA1_MACOCT5</name>
              <description>MAC Address Octet 5</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>MAC_IA1_MACOCT6</name>
              <description>MAC Address Octet 6</description>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>THR</name>
          <description>Ethernet MAC Threshold</description>
          <addressOffset>0x0000001C</addressOffset>
          <fields>
            <field>
              <name>MAC_THR_THRESH</name>
              <description>Threshold Value</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MCTL</name>
          <description>Ethernet MAC Management Control</description>
          <addressOffset>0x00000020</addressOffset>
          <fields>
            <field>
              <name>MAC_MCTL_START</name>
              <description>MII Register Transaction Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>MAC_MCTL_WRITE</name>
              <description>MII Register Transaction Type</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>MAC_MCTL_REGADR</name>
              <description>MII Register Address</description>
              <bitRange>[7:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MDV</name>
          <description>Ethernet MAC Management Divider</description>
          <addressOffset>0x00000024</addressOffset>
          <fields>
            <field>
              <name>MAC_MDV_DIV</name>
              <description>Clock Divider</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MTXD</name>
          <description>Ethernet MAC Management Transmit Data</description>
          <addressOffset>0x0000002C</addressOffset>
          <fields>
            <field>
              <name>MAC_MTXD_MDTX</name>
              <description>MII Register Transmit Data</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MRXD</name>
          <description>Ethernet MAC Management Receive Data</description>
          <addressOffset>0x00000030</addressOffset>
          <fields>
            <field>
              <name>MAC_MRXD_MDRX</name>
              <description>MII Register Receive Data</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NP</name>
          <description>Ethernet MAC Number of Packets</description>
          <addressOffset>0x00000034</addressOffset>
          <fields>
            <field>
              <name>MAC_NP_NPR</name>
              <description>Number of Packets in Receive FIFO</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TR</name>
          <description>Ethernet MAC Transmission Request</description>
          <addressOffset>0x00000038</addressOffset>
          <fields>
            <field>
              <name>MAC_TR_NEWTX</name>
              <description>New Transmission</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
